Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg1_hs_host.h
// OTG_HS_HCSPLT1 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT1_SPLITEN     (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT   (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_XACTPOS     (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_XACTPOS_0   (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_HUBADDR     (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_HUBADDR_0   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_PRTADDR     (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT1_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT1 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT1_DTERR        (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT1_FRMOR        (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT1_BBERR        (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT1_TXERR        (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT1_NYET         (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT1_ACK          (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT1_NAK          (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT1_STALL        (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT1_AHBERR       (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT1_CHH          (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT1_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK1 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_DTERRM    (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_FRMORM    (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_BBERRM    (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_TXERRM    (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_NYET      (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_ACKM      (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_NAKM      (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_STALLM    (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_AHBERR    (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_CHHM      (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ1 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ1_DPID        (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ1_DPID_0      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT      (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT_0    (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ      (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA1 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA1_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA1_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR2 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR2_CHENA       (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_CHDIS       (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_ODDFRM      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_DAD         (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_DAD_0       (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_MC          (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_MC_0        (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_EPTYP       (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_EPTYP_0     (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_LSDEV       (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_EPDIR       (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_EPNUM       (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_EPNUM_0     (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_MPSIZ       (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR2_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT2 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT2_SPLITEN     (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT   (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_XACTPOS     (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_XACTPOS_0   (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_HUBADDR     (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_HUBADDR_0   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_PRTADDR     (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT2_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT2 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT2_DTERR        (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT2_FRMOR        (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT2_BBERR        (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT2_TXERR        (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT2_NYET         (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT2_ACK          (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT2_NAK          (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT2_STALL        (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT2_AHBERR       (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT2_CHH          (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT2_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK2 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_DTERRM    (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_FRMORM    (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_BBERRM    (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_TXERRM    (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_NYET      (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_ACKM      (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_NAKM      (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_STALLM    (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_AHBERR    (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_CHHM      (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ2 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ2_DPID        (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ2_DPID_0      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT      (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT_0    (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ      (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA2 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA2_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA2_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR3 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR3_CHENA       (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_CHDIS       (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_ODDFRM      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_DAD         (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_DAD_0       (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_MC          (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_MC_0        (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_EPTYP       (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_EPTYP_0     (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_LSDEV       (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_EPDIR       (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_EPNUM       (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_EPNUM_0     (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_MPSIZ       (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT3 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT3_SPLITEN     (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT   (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_XACTPOS     (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_0   (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_HUBADDR     (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_0   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_PRTADDR     (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT3 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT3_DTERR        (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT3_FRMOR        (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT3_BBERR        (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT3_TXERR        (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT3_NYET         (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT3_ACK          (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT3_NAK          (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT3_STALL        (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT3_AHBERR       (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT3_CHH          (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT3_XFRC         (0x1u<<0)

