Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg1_hs_host.h
// OTG_HS_HCINTMSK3 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_DTERRM    (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_FRMORM    (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_BBERRM    (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_TXERRM    (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_NYET      (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_ACKM      (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_NAKM      (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_STALLM    (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_AHBERR    (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_CHHM      (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ3 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ3_DPID        (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ3_DPID_0      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT      (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_0    (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ      (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA3 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA3_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA3_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR4 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR4_CHENA       (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_CHDIS       (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_ODDFRM      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_DAD         (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_DAD_0       (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_MC          (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_MC_0        (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_EPTYP       (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_EPTYP_0     (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_LSDEV       (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_EPDIR       (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_EPNUM       (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_EPNUM_0     (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_MPSIZ       (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR4_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT4 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT4_SPLITEN     (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT   (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_XACTPOS     (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_XACTPOS_0   (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_HUBADDR     (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_HUBADDR_0   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_PRTADDR     (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT4_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT4 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT4_DTERR        (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT4_FRMOR        (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT4_BBERR        (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT4_TXERR        (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT4_NYET         (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT4_ACK          (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT4_NAK          (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT4_STALL        (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT4_AHBERR       (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT4_CHH          (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT4_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK4 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_DTERRM    (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_FRMORM    (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_BBERRM    (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_TXERRM    (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_NYET      (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_ACKM      (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_NAKM      (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_STALLM    (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_AHBERR    (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_CHHM      (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ4 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ4_DPID        (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ4_DPID_0      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT      (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT_0    (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ      (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA4 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA4_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA4_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR5 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR5_CHENA       (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_CHDIS       (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_ODDFRM      (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_DAD         (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_DAD_0       (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MC          (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MC_0        (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPTYP       (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPTYP_0     (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_LSDEV       (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPDIR       (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPNUM       (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPNUM_0     (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MPSIZ       (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT5 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT5_SPLITEN     (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT   (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_XACTPOS     (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_XACTPOS_0   (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_HUBADDR     (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_HUBADDR_0   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_PRTADDR     (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT5 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT5_DTERR        (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT5_FRMOR        (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT5_BBERR        (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT5_TXERR        (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT5_NYET         (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT5_ACK          (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT5_NAK          (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT5_STALL        (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT5_AHBERR       (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT5_CHH          (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT5_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK5 Configuration

