Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg1_hs_host.h
// OTG_HS_HCSPLT12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT12_SPLITEN    (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT  (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS    (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_0  (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR    (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_0  (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_PRTADDR    (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT12_DTERR       (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT12_FRMOR       (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT12_BBERR       (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT12_TXERR       (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT12_NYET        (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT12_ACK         (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT12_NAK         (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT12_STALL       (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT12_AHBERR      (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT12_CHH         (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT12_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_DTERRM   (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_FRMORM   (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_BBERRM   (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_TXERRM   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NYET     (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_ACKM     (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_NAKM     (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_STALLM   (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_AHBERR   (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_CHHM     (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_DPID       (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_DPID_0     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT     (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_0   (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ     (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA12 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA12_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA12_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHENA      (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_CHDIS      (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_ODDFRM     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_DAD        (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_DAD_0      (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MC         (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MC_0       (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPTYP      (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPTYP_0    (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_LSDEV      (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPDIR      (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPNUM      (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_EPNUM_0    (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MPSIZ      (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT13_SPLITEN    (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT  (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_XACTPOS    (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_0  (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_HUBADDR    (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_0  (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_PRTADDR    (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT13_DTERR       (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT13_FRMOR       (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT13_BBERR       (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT13_TXERR       (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT13_NYET        (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT13_ACK         (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT13_NAK         (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT13_STALL       (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT13_AHBERR      (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT13_CHH         (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT13_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_DTERRM   (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_FRMORM   (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_BBERRM   (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_TXERRM   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NYET     (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_ACKM     (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_NAKM     (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_STALLM   (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_AHBERR   (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_CHHM     (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_DPID       (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_DPID_0     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT     (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT_0   (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ     (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA13 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA13_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA13_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR14 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR14_CHENA      (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_CHDIS      (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_ODDFRM     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_DAD        (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_DAD_0      (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MC         (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MC_0       (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPTYP      (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPTYP_0    (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_LSDEV      (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPDIR      (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPNUM      (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_EPNUM_0    (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MPSIZ      (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR14_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT14 Configuration

