Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg1_hs_host.h
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_SPLITEN    (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT  (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_XACTPOS    (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_XACTPOS_0  (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_HUBADDR    (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_HUBADDR_0  (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_PRTADDR    (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT14_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT14 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT14_DTERR       (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT14_FRMOR       (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT14_BBERR       (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT14_TXERR       (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT14_NYET        (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT14_ACK         (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT14_NAK         (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT14_STALL       (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT14_AHBERR      (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT14_CHH         (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT14_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK14 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_DTERRM   (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_FRMORM   (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_BBERRM   (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_TXERRM   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NYET     (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_ACKM     (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NAKM     (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_STALLM   (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_AHBERR   (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_CHHM     (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ14 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_DPID       (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_DPID_0     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT     (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_0   (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ     (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA14 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA14_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA14_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR15 Configuration

#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHENA      (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHDIS      (0x1u<<30)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_ODDFRM     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_DAD        (0x7Fu<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_DAD_0      (0x1u<<22)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MC         (0x3u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MC_0       (0x1u<<20)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPTYP      (0x3u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPTYP_0    (0x1u<<18)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_LSDEV      (0x1u<<17)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPDIR      (0x1u<<15)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPNUM      (0xFu<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPNUM_0    (0x1u<<11)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MPSIZ      (0x7FFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT15 Configuration

#define OTG1_HS_HOST_OTG_HS_HCSPLT15_SPLITEN    (0x1u<<31)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT  (0x1u<<16)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_XACTPOS    (0x3u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_0  (0x1u<<14)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_HUBADDR    (0x7Fu<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_0  (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_PRTADDR    (0x7Fu<<0)
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT15 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINT15_DTERR       (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINT15_FRMOR       (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINT15_BBERR       (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINT15_TXERR       (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINT15_NYET        (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINT15_ACK         (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINT15_NAK         (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINT15_STALL       (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINT15_AHBERR      (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINT15_CHH         (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINT15_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK15 Configuration

#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_DTERRM   (0x1u<<10)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_FRMORM   (0x1u<<9)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_BBERRM   (0x1u<<8)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_TXERRM   (0x1u<<7)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NYET     (0x1u<<6)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_ACKM     (0x1u<<5)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NAKM     (0x1u<<4)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_STALL    (0x1u<<3)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_AHBERR   (0x1u<<2)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_CHHM     (0x1u<<1)
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ15 Configuration

#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_DPID       (0x3u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_DPID_0     (0x1u<<29)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT     (0x3FFu<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_0   (0x1u<<19)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ     (0x7FFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA15 Configuration

#define OTG1_HS_HOST_OTG_HS_HCDMA15_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG1_HS_HOST_OTG_HS_HCDMA15_DMAADDR_0   (0x1u<<0)
